Revit 2026 API

# ValueParsingOptions Properties

---

The ValueParsingOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllowedValues | The allowable range of values to be parsed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ValueParsingOptions Class

Autodesk.Revit.DB Namespace